## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # argocd_cluster.gcp-loadtesting will be created
+   resource "argocd_cluster" "gcp-loadtesting" {
+       id     = (known after apply)
+       info   = (known after apply)
+       name   = "gcp-loadtesting"
+       server = (sensitive)

+       config {
+           bearer_token = (sensitive value)

+           tls_client_config {
+               ca_data = (sensitive)
            }
        }
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_cluster_role.loadtesting-manager will be created
+   resource "kubernetes_cluster_role" "loadtesting-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager-role"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "*",
            ]
+           resources  = [
+               "*",
            ]
+           verbs      = [
+               "*",
            ]
        }
+       rule {
+           non_resource_urls = [
+               "*",
            ]
+           verbs             = [
+               "*",
            ]
        }
    }

  # kubernetes_cluster_role_binding.loadtesting-manager will be created
+   resource "kubernetes_cluster_role_binding" "loadtesting-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager-role-binding"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "loadtesting-manager-role"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "loadtesting-manager"
+           namespace = "kube-system"
        }
    }

  # kubernetes_service_account.loadtesting-manager will be created
+   resource "kubernetes_service_account" "loadtesting-manager" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 635.76 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 635.76 | 635.76|
| | **Total** | **0.00** | **635.76** | **635.76** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
